Xml-integration-demo/HotelRQ/20210619215042310AvailableHotelRooms.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><hot:Credentials Password="Sra@12896022" UserName="WESARA"/><wsa:Action>http://TekTravel/HotelBookingApi/AvailableHotelRooms</wsa:Action><wsa:To>https://api.tboholidays.com/HotelApi_V7/HotelService.svc</wsa:To></env:Header><env:Body><HotelRoomAvailabilityRequest xmlns="http://TekTravel/HotelBookingApi"><SessionId>07f7b538-d44f-40a4-8a85-2a1b12b5b335</SessionId><ResultIndex>90</ResultIndex><HotelCode>1083444</HotelCode><ResponseTime>17</ResponseTime><IsCancellationPolicyRequired>false</IsCancellationPolicyRequired></HotelRoomAvailabilityRequest></env:Body></env:Envelope>